Revit 2027 API
PointCloudFilterUtils.GetFilteredOutline Method
 Computes outline of a part of a box that satisfies given PointCloudFilter.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Outline GetFilteredOutline(
	PointCloudFilter filter,
	Outline box
)
Public Shared Function GetFilteredOutline (
	filter As PointCloudFilter,
	box As Outline
) As Outline
public:
static Outline^ GetFilteredOutline(
	PointCloudFilter^ filter,
	Outline^ box
)
static member GetFilteredOutline :
        filter : PointCloudFilter *
        box : Outline -> Outline
Parameters
filter PointCloudFilter
 Point cloud filter.
box Outline
 A box aligned with coordinate axes.
Return Value
Outline
 The bounding box of the set of all points within the original box that satisfy the filter. Not every point within the resulting outline satisfies the filter, but any point that is contained in the original box and satisfies the filter is guaranteed to be within the resulting outline.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudFilterUtils Class
Autodesk.Revit.DB.PointClouds Namespace